app/controllers/powers_controller.rb

SELECT "powers".* FROM "powers"
---
    def index
        powers = Power.all

SELECT "powers".* FROM "powers" WHERE "powers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        power = Power.find(params[:id])

SELECT "powers".* FROM "powers" WHERE "powers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def update
        power = Power.find(params[:id])